examples/opintooikeudet-payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:prod="http://docs.dev.koski-xroad.fi/producer">
   <soapenv:Header>
      <xro:protocolVersion>4.0</xro:protocolVersion>
      <!-- <xro:issue>?</xro:issue> -->
      <xro:id>ID123456</xro:id>
      <xro:userId>123456789</xro:userId>
      <xro:service id:objectType="SERVICE">
         <id:xRoadInstance>FI-DEV</id:xRoadInstance>
         <id:memberClass>GOV</id:memberClass>
         <id:memberCode>2769790-1</id:memberCode>
         <id:subsystemCode>koski</id:subsystemCode>
         <id:serviceCode>opintoOikeudetService</id:serviceCode>
         <id:serviceVersion>v1</id:serviceVersion>
      </xro:service>
      <xro:client id:objectType="SUBSYSTEM">
         <id:xRoadInstance>FI-DEV</id:xRoadInstance>
         <id:memberClass>GOV</id:memberClass>
         <id:memberCode>2769790-1</id:memberCode>
         <id:subsystemCode>koski</id:subsystemCode>
      </xro:client>
   </soapenv:Header>
   <soapenv:Body>
      <prod:opintoOikeudetService>
         <prod:hetu>210947-613P</prod:hetu>
      </prod:opintoOikeudetService>
   </soapenv:Body>
</soapenv:Envelope>

